
class EffectJQ {

    constructor() { }

}


//要素のアニメーションを直ちに完了にする
finish()

//要素を表示する
show()

//次のキューの実行を遅らせる
delay()

//要素をフェードインさせて表示する
fadeIn()

//要素をアニメーションさせる
animate()

//要素を指定した不透明度へフェードさせる
fadeTo()

//要素を非表示にする
hide()

//未実行のキューを全て削除する
clearQueue()

//キューを取得・設定する
queue()

//要素の表示・非表示をフェードで切り替える
fadeToggle()

//キューを次へ進める
dequeue()

//要素の表示・非表示を切り替える
toggle()

//要素のアニメーションを停止する
stop()

//要素をスライドアニメーションで非表示にする
slideUp()

//要素の表示・非表示をスライドアニメーションで切り替える
slideToggle()

//要素をスライドアニメーションで表示する
slideDOwn()


//要素をフェードアウトさせて非表示にする
fadeOut()


















