
class WrapJQ {

    constructor() { }

    



}


//要素のオフセットの基準となる先祖要素を選択する
offsetParent()

//ラップ集合から指定したインデックスの要素を選択する
eq()

//ラップ集合の選択操作を一つ戻す
end()

//ラップ集合の親要素を選択する
parent()

//ラップ集合の直前の要素を選択する
prev()

//ラップ集合の先祖要素を選択する
parents()

//要素自身を含む祖先要素で特定の要素を探して選択する
closest()

//ラップ集合から特定の子孫要素を持つ要素を選択する
has()

//ラップ集合の一部を選択する
slice()

//ラップ集合で反復処理を行い、戻り値から新しいjQueryオブジェクトを作る
map()

//ラップ集合から子要素を選択する
children()

//ラップ集合から条件に一致する要素を選択する
filter()

//ラップ集合の次移行の兄弟要素をマッチする要素まで選択する
nextUntil()

//ラップ集合に直前のラップ集合の要素を追加する
addBack()

//ラップ集合の前の兄弟要素をマッチする要素まで選択する
prevUntil()

//ラップ集合の兄弟要素を選択する
siblings()

//ラップ集合から最初の要素を選択する
first()

//要素のインデックスを取得する
index()

//ラップ集合からElementオブジェクトを取得する
get()

//ラップ集合から子要素のコンテンツを選択する
contents()

//ラップ集合の次移行の兄弟要素を選択する
nextAll()

//ラップ集合が指定した要素と一致するか調べる
is()

//ラップ集合から最後の要素を選択する
last()

//ラップ集合の前の兄弟要素全て選択する
prevAll()

//ラップ集合に要素を追加する
add()

//ラップ集合から特定の子孫要素を探して選択する
find()

//ラップ集合で反復処理を行う
each()

//ラップ集合の先祖要素をマッチする要素まで選択する
parentsUntil()

//ラップ集合から指定した要素を削除する
not()

//ラップ集合の直後の要素を選択する
next()











































